In [1]:
# Importing all the Required Libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots
from plotly.offline import init_notebook_mode
import seaborn as sns
import datetime as dt
import warnings
warnings.filterwarnings('ignore')
pd.set_option('display.max_columns',None)
init_notebook_mode(connected=True)

In [2]:
df=pd.read_csv('../original_data/KAIST_artists_daily_20230930.csv')

In [3]:
df

          id                name      date  viewcount
0         11     엔플라잉 (N.Flying)  20210418     130470
1       1819          경리 (나인뮤지스)  20210418        360
2       1624                 하동균  20210418      27206
3       1412             Lim Kim  20210418      12410
4        406                   진  20210418      80212
...      ...                 ...       ...        ...
584008  1390                  효린  20230930     229198
584009    29  먼데이키즈 (Monday Kiz)  20230930     267403
584010  1183              SG 워너비  20230930     318909
584011   287                  틴탑  20230930      63236
584012   779         태민 (TAEMIN)  20230930     145138

[584013 rows x 4 columns]

In [4]:
df['id'].unique().shape

(687,)

In [5]:
df['name'].unique().shape

(687,)

In [6]:
df['date'] = pd.to_datetime(df['date'], format='%Y%m%d')
df

          id                name       date  viewcount
0         11     엔플라잉 (N.Flying) 2021-04-18     130470
1       1819          경리 (나인뮤지스) 2021-04-18        360
2       1624                 하동균 2021-04-18      27206
3       1412             Lim Kim 2021-04-18      12410
4        406                   진 2021-04-18      80212
...      ...                 ...        ...        ...
584008  1390                  효린 2023-09-30     229198
584009    29  먼데이키즈 (Monday Kiz) 2023-09-30     267403
584010  1183              SG 워너비 2023-09-30     318909
584011   287                  틴탑 2023-09-30      63236
584012   779         태민 (TAEMIN) 2023-09-30     145138

[584013 rows x 4 columns]

In [7]:
df_summed = df.groupby('date')['viewcount'].sum().reset_index()

In [8]:
df_summed

          date  viewcount
0   2021-04-18  143766193
1   2021-04-19  151396196
2   2021-04-20  154802952
3   2021-04-21  159390870
4   2021-04-22  154424027
..         ...        ...
891 2023-09-26  183208309
892 2023-09-27  192905636
893 2023-09-28  182699650
894 2023-09-29  193305870
895 2023-09-30  193170672

[896 rows x 2 columns]

In [9]:
# Replace 'specified_date' with the date you want to compare against (in datetime format)
start_date = pd.to_datetime('2021-08-01') ### Change Here!
end_date = pd.to_datetime('2022-08-01')
df_summed_filtered = df_summed[(df_summed['date'] >= start_date) & (df_summed['date'] <= end_date)]
df_summed_filtered['viewcount'].sum()

65390666795

In [10]:
# Replace 'specified_date' with the date you want to compare against (in datetime format)
start_date = pd.to_datetime('2022-08-01') ### Change Here!
end_date = pd.to_datetime('2023-08-01')
df_summed_filtered = df_summed[(df_summed['date'] >= start_date) & (df_summed['date'] <= end_date)]
df_summed_filtered['viewcount'].sum()

67121118776

In [12]:
# Replace 'specified_date' with the date you want to compare against (in datetime format)
start_date = pd.to_datetime('2021-04-01') ### Change Here!
end_date = pd.to_datetime('2022-04-01')
df_summed_filtered = df_summed[(df_summed['date'] >= start_date) & (df_summed['date'] <= end_date)]
df_summed_filtered['viewcount'].sum()

61663409310

In [13]:
# Replace 'specified_date' with the date you want to compare against (in datetime format)
start_date = pd.to_datetime('2022-04-01') ### Change Here!
end_date = pd.to_datetime('2023-04-01')
df_summed_filtered = df_summed[(df_summed['date'] >= start_date) & (df_summed['date'] <= end_date)]
df_summed_filtered['viewcount'].sum()

64973786046